cask_args appdir: "/Applications"

# Homebrew recipes

brew "ansible"
brew "apr"
brew "aria2"
brew "autoconf"
brew "automake"
brew "thefuck"
brew "bash"
brew "bash-completion"
brew "bazel"
brew "bison"
brew "boost"
brew "c-ares"
brew "chruby"
brew "coreutils"
brew "ctop"
brew "curl"
brew "dep"
brew "dependency-check"
brew "docker-machine"
brew "docker-machine-driver-xhyve"
brew "emacs"
brew "freetype"
brew "gdbm"
brew "gettext"
brew "gflags"
brew "git"
brew "glib"
brew "gmp"
brew "gnutls"
brew "gperftools"
brew "htop"
brew "httpstat"
brew "hub"
brew "imagemagick"
brew "influxdb@0.8"
brew "irssi"
brew "jansson"
brew "jemalloc"
brew "jpeg"
brew "jq"
brew "kapacitor"
brew "kops"
brew "kubectx"
brew "kubernetes-cli"
brew "leiningen"
brew "leveldb"
brew "libassuan"
brew "libev"
brew "libevent"
brew "libffi"
brew "libgpg-error"
brew "libidn2"
brew "libpng"
brew "libtasn1"
brew "libtermkey"
brew "libtiff"
brew "libtool"
brew "libunistring"
brew "libuv"
brew "libvterm"
brew "libyaml"
brew "libzip"
brew "luajit"
brew "lz4"
brew "mas"
brew "msgpack"
brew "neovim"
brew "nettle"
brew "nghttp2"
brew "nmap"
brew "nvm"
brew "oniguruma"
brew "openldap"
brew "openssl"
brew "openssl@1.1"
brew "p11-kit"
brew "pbzip2"
brew "pcre"
brew "perl"
brew "pinentry"
brew "pkg-config"
brew "pv"
brew "python"
brew "python3"
brew "python@2"
brew "qt@5.5"
brew "readline"
brew "ripgrep"
brew "rocksdb"
brew "ruby"
brew "ruby-install"
brew "shellcheck"
brew "snappy"
brew "sops"
brew "spdylay"
brew "sqlite"
brew "thefuck"
brew "tig"
brew "tldr"
brew "tmux"
brew "tmux-mem-cpu-load"
brew "tree"
brew "unibilium"
brew "vim"
brew "watch"
brew "watchman"
brew "wget"
brew "xz"
brew "imagemagick"
brew "emacs", args: ["with-cocoa", "with-gnutls"]

# Taps
tap "caskroom/cask"
tap "caskroom/fonts"

# Casks
cask "font-fira-code"

# Mac App Store
mas "Helium", id: 1054607607
mas "iHex", id: 909566003
mas "Things3", id: 904280696
mas "Gifox – GIF Recording & Shari… ", id: 1082624744
